Revit 2027 API
DividedSurface.AllGridRotation Property
Angle of rotation applied to the U- and V- directions together.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AllGridRotation { get; set; }
Public Property AllGridRotation As Double
	Get
	Set
public:
property double AllGridRotation {
	double get ();
	void set (double value);
}
member AllGridRotation : float with get, set
Property Value
Double
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace